---
kind: type
id: T:Autodesk.Revit.DB.MeshFromGeometryOperationIssue
source: html/6c89d542-b05c-bbbf-eb8d-e291d71865d0.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationIssue

Issues encountered while constructing meshes as fallbacks
 for geometrical operations.

## Syntax (C#)
```csharp
public enum MeshFromGeometryOperationIssue
```